CSI API ETABS v1

# cSapModelLoadCases Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cLoadCases LoadCases { get; }

    ReadOnly Property LoadCases As cLoadCases
    	Get

    Dim instance As cSapModel
    Dim value As cLoadCases

    value = instance.LoadCases

    property cLoadCases^ LoadCases {
    	cLoadCases^ get ();
    }

    abstract LoadCases : cLoadCases with get

#### Property Value

Type: cLoadCases

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com